Repository: gtkhash/gtkhash
Catalog: po/*.po
Languages: et, hi

source: Lowercase Hexadecimal
et: Väiketähed kuueteistkümnendsüsteemis
hi: लोअरकेस हेक्साडेसिमल

source: Uppercase Hexadecimal
et: Suurtähed kuueteistkümnendsüsteemis
hi: अपरकेस हेक्साडेसिमल

source: Copy _Digest
et: Kopeeri _kokkuvõte
hi: डाइजेस्ट कॉपी करें (_D)

source: Show _Toolbar
et: Näita _tööriistariba
hi: टूलबार दिखाएं (_T)

source: _File
et: _Fail
hi: फाइल (_F)

# menu
source: _Open Digest File…
et: _Ava kokkuvõttefail…
hi: डाइजेस्ट फाइल खोलें (_O)…

# menu
source: _Save Digest File…
et: _Salvesta kokkuvõttefail…
hi: डाइजेस्ट फाइल सहेजें (_S)…

source: _Edit
et: _Redigeeri
hi: संपादित करें (_E)

source: _View
et: _Vaade
hi: देखें (_V)

source: _Text
et: _Tekst
hi: पाठ (_T)

source: File _List
et: Faili _loend
hi: फाइल सूची (_L)

source: _Help
et: _Abi
hi: सहायता (_H)

source: File:
et: Fail:
hi: फाइल:

source: Text:
et: Tekst:
hi: पाठ:

source: Check:
et: Kontrolli:
hi: जांच:

source: Paste digest from clipboard
et: Kleebi kokkuvõte lõikelaualt
hi: क्लिपबोर्ड से डाइजेस्ट पेस्ट करें

source: HMAC Key:
et: HMAC võti:
hi: HMAC कुंजी:

source: File
et: Fail
hi: फाइल

source: Ha_sh
et: Rä_si
hi: हैश (_s)

source: GtkHash Preferences
et: GtkHashi eelistused
hi: GtkHash प्राथमिकताएं

source: Hash Functions
et: Räsifunktsioonid
hi: हैश प्रकार्य

source: MAC Functions
et: MAC funktsioonid
hi: MAC प्रकार्य

source: Digest Format:
et: Kokkuvõtte vorming:
hi: डाइजेस्ट प्रारूप:

source: Checksum Calculator
et: Kontrollsumma kalkulaator
hi: चेकसम कैलकुलेटर

source: Calculate message digests or checksums
et: Sõnumi kokkuvõtete või kontrollsummade arvutamine
hi: संदेश डाइजेस्ट या चेकसम की गणना करें

source: Open Digest File
et: Ava kokkuvõtte fail
hi: डाइजेस्ट फाइल खोलें

source: _Open
et: _Ava
hi: खोलें (_O)

source: _Cancel
et: _Tühista
hi: रद्द करें (_C)

source: Digest/Checksum Files (*.sha1, *.md5, *.sfv, …)
et: Kokkuvõtte/kontrollsumma failid (*.sha1, *.md5, *.sfv, …)
hi: डाइजेस्ट/चेकसम फाइलें (*.sha1, *.md5, *.sfv,…)

source: All Files
et: Kõik failid
hi: सभी फाइलें

source: Save Digest File
et: Salvesta kokkuvõttefail
hi: डाइजेस्ट फाइल सहेजें

source: _Save
et: _Salvesta
hi: सहेजें (_S)

source: A desktop utility for computing message digests or checksums
et: Töölaua utiil sõnumite kokkuvõtete või kontrollsummade arvutamiseks
hi: मैसेज डाइजेस्ट या चेकसम की गणना करने के लिए एक डेस्कटॉप उपयोगिता

source: translator-credits
et: vaba, 2023😎️
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>

source: Select Files
et: Vali Failid
hi: फाइलें चुनें

source: _Show HMAC Key
et: _Näita HMAC võtit
hi: HMAC कुंजी दिखाएं (_S)

source: Failed to read check file "%s": %s
et: Kontrollfaili "%s" lugemine nurjus: %s
hi: चेक फाइल "%s" को पढ़ने में विफल: %s

source: Not a regular file
et: Pole tavaline fail
hi: कोई नियमित फाइल नहीं

source: Failed to add file "%s": %s
et: Faili "%s" lisamine nurjus: %s
hi: फाइल "%s" जोड़ने में विफल: %s

source: Unknown Hash Function name "%s"
et: Tundmatu räsifunktsiooni nimi "%s"
hi: अज्ञात हैश प्रकार्य नाम "%s"

# --help
source: Check against the specified digest or checksum
et: Kontrollige määratud kokkuvõtte või kontrollsummaga
hi: निर्दिष्ट डाइजेस्ट या चेकसम के विरुद्ध जांच करें

# --help
source: DIGEST
et: KOKKUVÕTE
hi: डाइजेस्ट

# --help
source: Check digests or checksums from the specified file
et: Kontrollige määratud faili kokkuvõtteid või kontrollsummasid
hi: निर्दिष्ट फाइल से डाइजेस्ट या चेकसम की जांच करें

# --help
source: FILE|URI
hi: फाइल|URI

# --help
source: Enable the specified Hash Function (e.g. MD5)
et: Lubage määratud räsifunktsioon (nt MD5)
hi: निर्दिष्ट हैश प्रकार्य सक्षम करें (उदा. MD5)

# --help
source: FUNCTION
et: FUNKTSIOON
hi: प्रकार्य

# --help
source: Hash the specified text
et: Määratud teksti räsi
hi: निर्दिष्ट पाठ को हैश करें

# --help
source: TEXT
et: TEKST
hi: पाठ

# --help
source: Show version information
et: Kuva versiooniteave
hi: संस्करण जानकारी दिखाएं

# --help
source: [FILE|URI...]
hi: [फाइल|URI...]

source: Failed to enable any supported hash functions.
et: Toetatud räsifunktsioonide lubamine ebaõnnestus.
hi: किसी भी समर्थित हैश प्रकार्य को सक्षम करने में विफल।

source: %u minute left
et: %u minut jäänud
hi: %u मिनट बाकी है

source: %u second left
et: %u sekund jäänud
hi: %u सेकंड बचे हैं

source: %s of %s - %s (%s/sec)
et: %s/%s – %s (%s/s)
hi: %s का %s - %s (%s/sec)

source: _Copy Digest
et: _Kopeeri kokkuvõte
hi: डाइजेस्ट कॉपी करें (_C)

source: Show _Disabled Hash Functions
et: Kuva _Keelatud räsifunktsioonid
hi: अक्षम हैश प्रकार्य दिखाएं (_D)

source: Hash Function
et: Räsifunktsioon
hi: हैश प्रकार्य

source: Digest
et: KOKKUVÕTE
hi: डाइजेस्ट

source: H_ash
et: R_äsi
hi: हैश (_a)

source: Checksums
et: Kontrollsummad
hi: चेकसम

source: GtkHash is an application for computing file checksums, or message digests. It's designed to be an easy to use, graphical alternative to command-line programs such as md5sum.
et: GtkHash on rakendus failide kontrollsummade või sõnumite kokkuvõtete arvutamiseks. See on loodud lihtsasti kasutatavaks graafiliseks alternatiiviks käsureaprogrammidele nagu md5sum.
hi: GtkHash फाइल चेकसम, या संदेश डाइजेस्ट की गणना करने के लिए एक एप्लिकेशन है। इसे md5sum जैसे कमांड-लाइन प्रोग्राम के लिए उपयोग में आसान, ग्राफिकल विकल्प के रूप में डिज़ाइन किया गया है।

source: Supported hash functions include MD5, SHA1, SHA256, SHA512 and CRC32.
et: Toetatud räsifunktsioonid hõlmavad MD5, SHA1, SHA256, SHA512 ja CRC32.
hi: समर्थित हैश प्रकार्य में MD5, SHA1, SHA256, SHA512 और CRC32 शामिल हैं।

source: Adds message digests or checksums to file properties
et: Lisab faili atribuutidele sõnumite kokkuvõtted või kontrollsummad
hi: फाइल प्रॉपर्टी में मैसेज डाइजेस्ट या चेकसम जोड़ता है
